IoTHomeJM/ESP32_Button_transmitter/src/main.cpp

#include <Adafruit_SH1106.h>   // oled 1.3 cala
#include <Adafruit_SSD1306.h>  // oled 0.9 cala
#include <Arduino.h>
#include <ArduinoOTA.h>
#include <EEPROM.h>
#include <Fonts/FreeSans12pt7b.h>
#include <Fonts/FreeSansBold24pt7b.h>
#include <LightDimmerESP32.h>
#include <OneButton.h>
#include <OneWire.h>
#include <SPI.h>
#include <Sim800l.h>
#include <SimpleTimer.h>
#include <TimeLib.h>
#include <WebServer.h>
#include <WiFi.h>
#include <Wire.h>
#include <esp32_can.h>
#include <void.h>

#include "RF24.h"
#include "SPIFFS.h"
#include "nRF24L01.h"

unsigned int czasnazapisweeprom = 6000;  //w milisekundach, 6 sekund, w przypadku brak zmiany jasnosci przez ten czas powoduje zapis w eeprom

//const byte portLED = 19, portLED2 = 18, portLED3 = 17;  // dostepne: DIM1/R - 19 | DIM2/G - 18 | DIM3/B - 17

uint16_t FreqLED = 25000;     // czestotliwosc LED
uint16_t ResolutionLED = 10;  // Rozdzielczosc w bitach.

// zmiennych ponizej nie edytujemy
unsigned int jasnosc = 0, jasnosc2 = 0, jasnosc3 = 0;
unsigned int jasnosc_last = 0;
unsigned int jasnosc_max = 0;
byte eepromBUF[32];  // bufor dla zapisu/odczytu eeprom
bool zapiszweeprom = 0;
uint64_t aktualnyCzas = 0;
uint64_t zapamietanyCzas1 = 0;
uint64_t zapamietanyCzasEEPROM = 0;

// LightDimmerESP32 DimLED1;
LightDimmerESP32 led[3];
bool dim1 = 0, dim2 = 0, dim3 = 0, LightOnBoot = 1;
uint8_t DimUpDownResolution = 20;  // szybkosc regulacji jasnosci led za pomoca przycisku

// dla przycisku, regulacja jasnosci
int16_t dimmset_now = 0;
int16_t dimmset_last = 0;
int16_t dimmset_min = 2;
int16_t dimmset_max = 999, dimm2set_max = 999, dimm3set_max = 999;

//<--Dimmer
//--> server
boolean ServerActive = 1;

char* ssid = "SWModule";        // Enter SSID here
char* password = "1234567890";  // Enter Password here
WebServer server(80);
//<--server

//--> CAN-BUS

uint8_t Flag = 0;      // 1 bit
uint8_t SubDevID = 0;  // 4 bity od 0 do 15
uint8_t DevID = 2;     // 8bit ID tego urzadzenia, ID 1 to master.
uint32_t frameID = 0;
bool allFrame = 0;         // jesli 0 to przyjmuje ramki z filtrem
bool OnDevices[25] = {0};  // lista wlaczonych urzadzen - tylko dla mastera. test
//<-- CAN-BUS

#define eeprom 0x50  // Address of 24LC256 eeprom chip

SimpleTimer timer;

const uint8_t SW1pin = 0;
const uint8_t SW1TouchPin = 33;

//--> NRF settings
byte NRFbuf[32] = {0};  // bufor dla nrf
byte RF24_rxAddr[6] = "00001";
uint8_t NRFchannel = 1;
uint8_t PALevel = 1;             // 0=MIN, 1=LOW, 2=HIGH, 3=MAX
RF24 radio(27, 15, 14, 12, 13);  //JLU //CE CSN SCK MISO MOSI // ta trzeba uzywac do ESP32 https://github.com/nhatuan84/RF24
//<--NRF

//--> temeratura
OneWire ds(23);
byte DallasAddr[8];
bool CzyJestCzujnikTemperaury = 1;
float celsius = -99;
//<--

//--> dla oled 0.9 cala Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
// #define OLED_RESET     -1 // Reset pin # (or -1 if sharing Arduino reset pin)
// Adafruit_SSD1306 display(128, 64, &Wire, OLED_RESET);
//<--

//--> dla oled 1.3 cala
Adafruit_SH1106 display(21, 22);
//<--

// OneButton button(SW1pin, true, 1);
OneButton button(SW1pin, true);
bool button_is_long_pressed = 0;
bool dimming_up = 0;
bool poRestarcieTestSW1 = 1;

char timestr[10] = "--:--:--";

boolean SW1TouchEnable = 0;  // aktywacja funkcji przycisku dotyku
boolean SW1TouchActive = 0;  // dotyk uruchamia sie dopiero po inicjalizacji
uint8_t SW1TouchVal = 255;
uint8_t SW1TouchMax = 255;  // ustalana po inicjalizacji wartosc dotyku nie nacisnietego
boolean SW1TouchPressed = 0;
boolean SW1TouchPrevious = 0;
uint8_t SW1TouchFilter = 0;
int SW1TouchValMin = 255;  //tylko do testow

boolean OTAActive = 0, FactorySet = 0, SettingSave = 0;
String json;

Sim800l Sim800l;     //to declare the library
int serialmode = 0;  //0-wylaczony, 1-wlaczoy LOG, 2-wlaczony SIM
String SMSbuf = "";
char incomingByte;
bool gsminit = 0;

int drvsimreset = 33;
bool oleddim = 0;

int relay = 25, relay1 = 26;
bool sp[10] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0};  // status przekaznikow

void setup() {
    //--> EEPROM
    Wire.begin(21, 22);  // sda, scl
    Wire.setClock(4000000);
    for (int i = 0; i < 32; ++i) {
        eepromBUF[i] = readEEPROM(i);
    }  // read 32 byte eeprom
    jasnosc = eepromBUF[0] * 256 + eepromBUF[1];
    jasnosc2 = eepromBUF[6] * 256 + eepromBUF[7];
    jasnosc3 = eepromBUF[8] * 256 + eepromBUF[9];
    DevID = eepromBUF[4];
    SubDevID = eepromBUF[5];
    LightOnBoot = eepromBUF[10];
    Flag = eepromBUF[11];
    allFrame = eepromBUF[12];
    PALevel = eepromBUF[13];
    NRFchannel = eepromBUF[14];
    SW1TouchEnable = eepromBUF[15];
    OTAActive = eepromBUF[16];
    ServerActive = eepromBUF[17];
    ResolutionLED = eepromBUF[18];
    FreqLED = eepromBUF[19] * 256 + eepromBUF[20];
    czasnazapisweeprom = eepromBUF[21] * 256 + eepromBUF[22];
    serialmode = eepromBUF[23];
    dimmset_max = eepromBUF[24] * 256 + eepromBUF[25];
    DimUpDownResolution = eepromBUF[26];
    dimm2set_max = eepromBUF[27] * 256 + eepromBUF[28];
    dimm3set_max = eepromBUF[29] * 256 + eepromBUF[30];

    jasnosc_last = jasnosc;
    dimmset_now = jasnosc;
    dimmset_last = jasnosc;  // dla przycisku

    // konfikuracja poczatkowa przekaznika
    pinMode(relay, OUTPUT);
    pinMode(relay1, OUTPUT);
    digitalWrite(relay, sp[0]);
    digitalWrite(relay1, sp[1]);

    if (serialmode == 1) {
        Serial.begin(115200);      // dla serial monitro
    } else if (serialmode == 2) {  //dla SIM
        Serial.begin(9600);
    } else {
    }

    create_json();

    if (serialmode == 1) {
        Serial.print("json: ");
        Serial.println(json);
        Serial.print("jasnosc: ");
        Serial.println(jasnosc);
        Serial.print("jasnosc2: ");
        Serial.println(jasnosc2);
        Serial.print("jasnosc3: ");
        Serial.println(jasnosc3);
        Serial.print("DevID: ");
        Serial.println(DevID);
        Serial.print("LightOnBoot: ");
        Serial.println(LightOnBoot);
        Serial.print("PALevel: ");
        Serial.println(PALevel);
        Serial.print("NRFchannel: ");
        Serial.println(NRFchannel);
        Serial.print("SW1TouchEnable: ");
        Serial.println(SW1TouchEnable);
        Serial.print("OTAActive: ");
        Serial.println(OTAActive);
        Serial.print("ServerActive: ");
        Serial.println(ServerActive);
        Serial.print("ResolutionLED: ");
        Serial.println(ResolutionLED);
        Serial.print("FreqLED: ");
        Serial.println(FreqLED);
        Serial.print("czasnazapisweeprom: ");
        Serial.println(czasnazapisweeprom);
        Serial.print("serialmode: ");
        Serial.println(serialmode);
        Serial.print("dimmset_max: ");
        Serial.println(dimmset_max);
        Serial.print("dimm2set_max: ");
        Serial.println(dimm2set_max);
        Serial.print("dimm3set_max: ");
        Serial.println(dimm3set_max);
        Serial.print("DimUpDownResolution: ");
        Serial.println(DimUpDownResolution);
    }
    //<-- EEPROM
    /*
    //-->  ESP32 Dimmer settings
    ledcSetup(0, FreqLED, ResolutionLED);  // ledChannel, freq, resolution
    ledcSetup(1, FreqLED, ResolutionLED);
    ledcSetup(2, FreqLED, ResolutionLED);
    // for (uint8_t i = 0; i < 3; i++) {ledcAttachPin(i+17, 0);}

