IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
void sendCAN(uint8_t toID, uint8_t fnID, uint32_t fndata, uint32_t fndata2) {
    // tworzenie ID RAMKI
    //             | 8bit fnID  | 1bit Flag  | 4bit SubDevID  | 8bit DevID | 8bit toID |
    frameID = (fnID << 21) + (Flag << 20) + (SubDevID << 16) + (DevID << 8) + toID;

    CAN_FRAME outFrame;
    outFrame.rtr = 0;
    outFrame.id = frameID;
    outFrame.extended = true;
    outFrame.length = 8;
    outFrame.data.uint32[0] = fndata;
    outFrame.data.uint32[1] = fndata2;
    CAN0.sendFrame(outFrame);
    if (serialmode == 1) {
        Serial.print("Can send ID: ");
        Serial.print(frameID, HEX);
        Serial.print(" toID: ");
        Serial.print(toID);
        Serial.print(" fnID: ");
        Serial.print(fnID);
        Serial.print(" fndata: ");
        Serial.println(fndata);
    }
    frameID = 0;
}

//<-- CAN-BUS
//--> server
void WIFI_APSTART() {
    WiFi.persistent(false);
    WiFi.disconnect();
    WiFi.mode(WIFI_OFF);
    WiFi.mode(WIFI_STA);
    delay(100);

    IPAddress local_ip(192, 168, 1, 100);
    IPAddress gateway(192, 168, 1, 1);
    IPAddress subnet(255, 255, 255, 0);

    WiFi.softAPConfig(local_ip, gateway, subnet);
    WiFi.softAP(ssid, password);
}
void konfiguracja() {
    DevID = server.arg("DevID").toInt();
    SubDevID = server.arg("SubDevID").toInt();
    Flag = server.arg("Flag").toInt();
    allFrame = server.arg("allFrame").toInt();
    PALevel = server.arg("PALevel").toInt();
    NRFchannel = server.arg("NRFchannel").toInt();
    SW1TouchEnable = server.arg("SW1TouchEnable").toInt();
    OTAActive = server.arg("OTAActive").toInt();
    FactorySet = server.arg("FactorySet").toInt();
    ServerActive = server.arg("ServerActive").toInt();
    ResolutionLED = server.arg("ResolutionLED").toInt();
    FreqLED = server.arg("FreqLED").toInt();
    czasnazapisweeprom = server.arg("czasnazapisweeprom").toInt();
    LightOnBoot = server.arg("LightOnBoot").toInt();
    serialmode = server.arg("serialmode").toInt();
    DimUpDownResolution = server.arg("DimUpDownResolution").toInt();
    SettingSave = server.arg("eeprom_save").toInt();

    jasnosc = server.arg("jasnosc1").toInt();
    dim1 = 1;
    jasnoscLED();
    dimmset_max = server.arg("dimmset_max").toInt();

    jasnosc2 = server.arg("jasnosc2").toInt();
    dim2 = 1;
    jasnoscLED();
    dimm2set_max = server.arg("dimm2set_max").toInt();

    jasnosc3 = server.arg("jasnosc3").toInt();
    dim3 = 1;
    jasnoscLED();
    dimm3set_max = server.arg("dimm3set_max").toInt();

    create_json();

    server.send(200, "application/json", json);
}

void handle_NotFound() {
    server.send(404, "text/plain", "Not found");
}
void index_html() {
    File file = SPIFFS.open("/index.html");
    size_t sent = server.streamFile(file, "text/HTML");
}
void css_css() {
}
void create_json() {
    json =
        "[{\"DevID\":" + String(DevID) +
        ",\"SubDevID\":" + String(SubDevID) +
        ",\"Flag\":" + String(Flag) +
        ",\"allFrame\":" + String(allFrame) +
        ",\"PALevel\":" + String(PALevel) +
        ",\"NRFchannel\":" + String(NRFchannel) +
        ",\"SW1TouchEnable\":" + String(SW1TouchEnable) +
        ",\"OTAActive\":" + String(OTAActive) +
        ",\"ServerActive\":" + String(ServerActive) +
        ",\"ResolutionLED\":" + String(ResolutionLED) +
        ",\"FreqLED\":" + String(FreqLED) +
        ",\"czasnazapisweeprom\":" + String(czasnazapisweeprom) +
        ",\"LightOnBoot\":" + String(LightOnBoot) +
        ",\"serialmode\":" + String(serialmode) +
        ",\"frameID\":" + String(frameID) +
        ",\"celsius\":" + String(celsius) +
        ",\"jasnosc1\":" + String(jasnosc) +
        ",\"jasnosc2\":" + String(jasnosc2) +
        ",\"jasnosc3\":" + String(jasnosc3) +
        ",\"dimmset_max\":" + String(dimmset_max) +
        ",\"dimm2set_max\":" + String(dimm2set_max) +
        ",\"dimm3set_max\":" + String(dimm3set_max) +
        ",\"DimUpDownResolution\":" + String(DimUpDownResolution) +
        "}]";
}

void handleRoot() {  // When URI / is requested, send a web page with a button
    // to toggle the LED
    server.send(
        200, "text/html",
        "<form action=\"/login\" method=\"POST\"><input type=\"text\" "
        "name=\"username\" placeholder=\"Username\"></br><input "
        "type=\"password\" name=\"password\" "
        "placeholder=\"Password\"></br><input type=\"submit\" "
        "value=\"Login\"></form><p>Try 'John Doe' and 'password123' ...</p>");
}
void handleLogin() {  // If a POST request is made to URI /login
    if (!server.hasArg("username") || !server.hasArg("password") ||
        server.arg("username") == NULL ||
        server.arg("password") == NULL) {  // If the POST request doesn't have
        // username and password data
        server.send(400, "text/plain",
                    "400: Invalid Request");  // The request is invalid, so send
                                              // HTTP status 400
        return;
    }
    if (server.arg("username") == "John Doe" &&
        server.arg("password") == "password123") {  // If both the username and
        // the password are correct
        server.send(200, "text/html",
                    "<h1>Welcome, " + server.arg("username") +
                        "!</h1><p>Login successful</p>");
    } else {  // Username and password don't match
        server.send(401, "text/plain", "401: Unauthorized");
    }
}

//<-- server

void zmiana_poziomu_jasnosci() {
    static uint64_t zapamietanyCzas1 = 0;
    static uint64_t zapamietanyCzas2 = 0;

    if (aktualnyCzas - zapamietanyCzas2 >= 2000UL) {
        if (aktualnyCzas - zapamietanyCzas1 >= 200UL) {
            zapamietanyCzas1 = aktualnyCzas;

            if (dimming_up) {
                if (dimmset_now < 15) {
                    dimmset_now += 1;
                } else if ((dimmset_now >= 15) && (dimmset_now <= 40)) {
                    dimmset_now += 5;
                } else {
                    dimmset_now += DimUpDownResolution;
                }
            } else {
                if (dimmset_now < 15) {
                    dimmset_now -= 1;
                } else if ((dimmset_now >= 15) && (dimmset_now <= 40)) {
                    dimmset_now -= 5;
                } else {
                    dimmset_now -= DimUpDownResolution;
                }
            }

