IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
            if (dimmset_now > dimmset_max) {
                dimmset_now = dimmset_max;
                zapamietanyCzas2 = aktualnyCzas;
            }
            if (dimmset_now < dimmset_min) {
                dimmset_now = dimmset_min;
                zapamietanyCzas2 = aktualnyCzas;
            }
            dimmset_last = dimmset_now;
            jasnosc = dimmset_now;
            dim1 = 1;  // dim2=0; dim3=0;
            jasnoscLED();
        }
        if (dimmset_now >= dimmset_max || dimmset_now <= dimmset_min) {
            dimming_up = !dimming_up;
        }
    }
}

void oneClick() {
    if (serialmode == 1) Serial.println("oneClick");
    //if(dimmset_now==0 && dimmset_last==0) { dimmset_now=dimmset_max; dimmset_last=dimmset_now; jasnosc=dimmset_now; dim1=1; jasnoscLED(); } //  //pierwszy raz po reset
    //else
    if (dimmset_now == 0) {
        dimmset_now = dimmset_last;
        jasnosc = dimmset_now;
        dim1 = 1;
        jasnoscLED();
    }  //wlaczamy na poprzedni poziom
    else if (dimmset_now > 0 && dimmset_last <= dimmset_now) {
        dimmset_now = 0;
        jasnosc = dimmset_now;
        dim1 = 1;
        jasnoscLED();
    }  //wylaczamy
}

void DoubleClick() {
    if (serialmode == 1) Serial.println("DoubleClick");
    if (dimmset_now > 0 && dimmset_last < (dimmset_max + 1) && dimmset_now < (dimmset_max + 1)) {
        dimmset_last = dimmset_now;
        dimmset_now = (dimmset_max + 1);
        jasnosc = dimmset_now;
        dim1 = 1;
        jasnoscLED();
    }  //wlaczamy na MAX
    else if (dimmset_now == (dimmset_max + 1) && dimmset_last != (dimmset_max + 1)) {
        dimmset_now = dimmset_last;
        jasnosc = dimmset_now;
        dim1 = 1;
        jasnoscLED();
    }  //wlaczamy na poprzedni poziom
    else if (dimmset_now == 0) {
        dimmset_now = (dimmset_max + 1);
        jasnosc = dimmset_now;
        dim1 = 1;
        jasnoscLED();
    }  //na MAX z wylaczonego
}

void LongPressStart() {
    if (serialmode == 1) Serial.println("LongPressStart");
    button_is_long_pressed = 1;
}
void LongPressStop() {
    if (serialmode == 1) Serial.println("LongPressStop");
    button_is_long_pressed = 0;
}

//<-- DLA dimmer
void jasnoscLED() {
    uint16_t TMPjasnosc = 0, TMPjasnosc2 = 0, TMPjasnosc3 = 0;

    if (dim1 == 1) {
        //led[0].setupMax(jasnosc1);
        eepromBUF[0] = readEEPROM(0);
        eepromBUF[1] = readEEPROM(1);
        TMPjasnosc = eepromBUF[0] * 256 + eepromBUF[1];  // odczyt zapisanej jasnosci
        if ((jasnosc > 0 && jasnosc < dimmset_max - 1 && TMPjasnosc != jasnosc)) {
            dim1 = 1;
        } else {
            dim1 = 0;
        }
    }

    if (dim2 == 1) {
        //led[1].setupMax(jasnosc2);
        eepromBUF[6] = readEEPROM(6);
        eepromBUF[7] = readEEPROM(7);
        TMPjasnosc2 = eepromBUF[6] * 256 + eepromBUF[7];
        if ((jasnosc2 > 0 && jasnosc2 < dimm2set_max - 1 && TMPjasnosc2 != jasnosc2)) {
            dim2 = 1;
        } else {
            dim2 = 0;
        }
    }

    if (dim3 == 1) {
        //led[2].setupMax(jasnosc3);
        eepromBUF[8] = readEEPROM(8);
        eepromBUF[9] = readEEPROM(9);
        TMPjasnosc3 = eepromBUF[8] * 256 + eepromBUF[9];
        if ((jasnosc3 > 0 && jasnosc3 < dimm3set_max - 1 && TMPjasnosc3 != jasnosc3)) {
            dim3 = 1;
        } else {
            dim3 = 0;
        }
    }

    rysuj_jasnosc_na_lcd();

    if (dim1 == 1 || dim2 == 1 || dim3 == 1) {
        jasnosc_last = jasnosc;
        zapamietanyCzas1 = aktualnyCzas;
        zapiszweeprom = 1;
    }
}

//--> eeprom
void DimmWriteEEPROM() {  // zapisywanie z opoznienim aktualnej nastawy jasnosci LED do EEPROM
    if (aktualnyCzas - zapamietanyCzas1 >= czasnazapisweeprom) {
        if (dim1 == 1) {
            if (aktualnyCzas - zapamietanyCzasEEPROM >= 6) {
                dim1 = 0;
                if (serialmode == 1) Serial.println("Zapisywanie w EEPROM DIM 1 ...");
                writeEEPROM(0, jasnosc, 2);
            }
        }
        if (dim2 == 1) {
            if (aktualnyCzas - zapamietanyCzasEEPROM >= 6) {
                dim2 = 0;
                if (serialmode == 1) Serial.println("Zapisywanie w EEPROM DIM 2 ...");
                writeEEPROM(6, jasnosc2, 2);
            }
        }
        if (dim3 == 1) {
            if (aktualnyCzas - zapamietanyCzasEEPROM >= 6) {
                dim3 = 0;
                if (serialmode == 1) Serial.println("Zapisywanie w EEPROM DIM 3 ...");
                writeEEPROM(8, jasnosc3, 2);
            }
        }
        if (dim1 == 0 && dim2 == 0 && dim3 == 0) {
            zapiszweeprom = 0;
        }
    }
}
void writeEEPROM(unsigned int adres, uint16_t dane, uint8_t dlugosc) {
    Wire.beginTransmission(eeprom);
    Wire.write((int)(adres >> 8));    // MSB
    Wire.write((int)(adres & 0xFF));  // LSB
    switch (dlugosc) {
        case 1:
            Wire.write((byte)(dane & 0xFF));
            break;
        case 2:
            Wire.write((byte)(dane >> 8));
            Wire.write((byte)(dane & 0xFF));
            break;
    }
    Wire.endTransmission();
    if (serialmode == 1) {
        Serial.println("Zapis EEPROM ok");
    }
    zapamietanyCzasEEPROM = aktualnyCzas;
}
void SettingWriteEEPROM() {
    if (serialmode == 1) Serial.print("Zapisywanie ustawien...");

    delay(6);
    writeEEPROM(29, dimm3set_max, 2);  // 29,30 BAJT dimm3set_max MSB
    delay(6);
    writeEEPROM(27, dimm2set_max, 2);  // 27,28 BAJT dimm2set_max MSB
    delay(6);
    writeEEPROM(26, DimUpDownResolution, 1);
    delay(6);
    writeEEPROM(24, dimmset_max, 2);
    delay(6);
    writeEEPROM(23, serialmode, 1);  // 23 BAJT serialmode
    delay(6);
    writeEEPROM(21, czasnazapisweeprom, 2);  // 21,22 BAJT czasnazapisweeprom MSB
    delay(6);
    writeEEPROM(19, FreqLED, 2);  // 19,20 BAJT FreqLED MSB 1388
    delay(6);
    writeEEPROM(18, ResolutionLED, 1);  // 18 BAJT ResolutionLED
    delay(6);
    writeEEPROM(17, ServerActive, 1);  // 17 BAJT ServerActive
    delay(6);
    writeEEPROM(16, OTAActive, 1);  // 16 BAJT OTAActive
    delay(6);
    writeEEPROM(15, SW1TouchEnable, 1);  // 15 BAJT SW1TouchEnable
    delay(6);
    writeEEPROM(14, NRFchannel, 1);  // 14 BAJT NRFchannel
    delay(6);
    writeEEPROM(13, PALevel, 1);  // 13 BAJT PALevel
    delay(6);
    writeEEPROM(12, allFrame, 1);  // 12 BAJT allFrame
    delay(6);
    writeEEPROM(11, Flag, 1);  // 11 BAJT Flag
    delay(6);
    writeEEPROM(10, LightOnBoot, 1);  // 10 BAJT LightOnBoot
    delay(6);
    writeEEPROM(8, jasnosc3, 2);  // 8,9 BAJT DIM3 jasnosc MSB
    delay(6);
    writeEEPROM(6, jasnosc2, 2);  // 6,7 BAJT DIM2 jasnosc MSB
    delay(6);
    writeEEPROM(5, SubDevID, 1);  // 5 BAJT SubDevID
    delay(6);
    writeEEPROM(4, DevID, 1);  // 4 BAJT devID
    delay(6);
    writeEEPROM(0, jasnosc, 2);  // 0,1 BAJT dim1 jasnosc MSB
    if (serialmode == 1) Serial.println("... zakonczone. Reset ESP.");
    SettingSave = 0;
    ESP.restart();
}
void FactoryWriteEEPROM() {
    if (serialmode == 1) Serial.print("Ustawienia fabryczne...");

    delay(6);
    writeEEPROM(29, 999, 2);  // 29,30 BAJT dimm3set_max MSB
    delay(6);
    writeEEPROM(27, 999, 2);  // 27,28 BAJT dimm2set_max MSB
    delay(6);
    writeEEPROM(26, 20, 1);  // 26 DimUpDownResolution
    delay(6);
    writeEEPROM(24, 999, 2);  // 24, 25 dimmset_max
    delay(6);
    writeEEPROM(23, 1, 1);  // 23 BAJT serialmode
    delay(6);
    writeEEPROM(21, 6000, 2);  // 21,22 BAJT czasnazapisweeprom MSB
    delay(6);
    writeEEPROM(19, 25000, 2);  // 19,20 BAJT FreqLED MSB 1388
    delay(6);
    writeEEPROM(18, 10, 1);  // 18 BAJT ResolutionLED
    delay(6);
    writeEEPROM(17, 1, 1);  // 17 BAJT ServerActive
    delay(6);
    writeEEPROM(16, 0, 1);  // 16 BAJT OTAActive
    delay(6);
    writeEEPROM(15, 0, 1);  // 15 BAJT SW1TouchEnable
    delay(6);
    writeEEPROM(14, 1, 1);  // 14 BAJT NRFchannel
    delay(6);
    writeEEPROM(13, 1, 1);  // 13 BAJT PALevel
    delay(6);
    writeEEPROM(12, 1, 1);  // 12 BAJT allFrame
    delay(6);
    writeEEPROM(11, 1, 1);  // 11 BAJT Flag
    delay(6);
    writeEEPROM(10, 1, 1);  // 10 BAJT LightOnBoot
    delay(6);
    writeEEPROM(8, 6, 2);  // 8,9 BAJT DIM3 jasnosc MSB
    delay(6);
    writeEEPROM(6, 6, 2);  // 6,7 BAJT DIM2 jasnosc MSB
    delay(6);
    writeEEPROM(5, 0, 1);  // 5 BAJT SubDevID
    delay(6);
    writeEEPROM(4, 0, 1);  // 4 BAJT devID
    // delay(6);writeEEPROM(2,998,2);  // wolne
    delay(6);
    writeEEPROM(0, 6, 2);  // 0,1 BAJT dim1 jasnosc MSB
    if (serialmode == 1) Serial.println("... zakonczone. Reset ESP.");
    FactorySet = 0;
    ESP.restart();
}

byte readEEPROM(unsigned int eeaddress) {
    byte rdata = 0xFF;
    Wire.beginTransmission(eeprom);
    Wire.write((int)(eeaddress >> 8));    // MSB
    Wire.write((int)(eeaddress & 0xFF));  // LSB
    Wire.endTransmission();
    Wire.requestFrom(eeprom, 1);
    if (Wire.available()) rdata = Wire.read();
    return rdata;
}

void rysuj_jasnosc_na_lcd() {
    if (jasnosc >= dimmset_max) {
        dimmset_now = dimmset_max;
    } else {
        dimmset_now = jasnosc;
    }

    int val = map(dimmset_now, 0, dimmset_max, 0, 95);
    if (val < 1 && dimmset_now > 0) {
        val = 1;
    }
    display.fillRect(16, 2, 95, 11, BLACK);
    display.fillRect(16, 2, val, 11, WHITE);

    // napisy na pasku jasnosci
    if (dimmset_now == 0) {
        display.setCursor(52, 4);
        display.println("O F F");
    }
    if (dimmset_now == 2) {
        display.setCursor(52, 4);
        display.println("M I N");
    }
    if (dimmset_now == (dimmset_max + 1)) {
        display.setTextColor(BLACK);
        display.setCursor(43, 4);
        display.println("F U L L");
        display.setTextColor(WHITE);
    }
    if (dimmset_now == dimmset_max) {
        display.setTextColor(BLACK);
        display.setCursor(50, 4);
        display.println("M A X");
        display.setTextColor(WHITE);
    }

    if (poRestarcieTestSW1) {
        display.setCursor(17, 4);
        display.println("START:");
    }  // wyswietlamy tylko przy pierwszym starcie lub restarcie procka
    if (poRestarcieTestSW1 && dimmset_now > 0) {
        poRestarcieTestSW1 = 0;
    }

