IoTHomeJM/ESP32_Button_transmitter/src/main.cpp
    display.display();
}

void rysujemy_na_lcd() {
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(WHITE);

    display.drawRoundRect(14, 0, 99, 15, 2, WHITE);
    display.drawCircle(5, 7, 5, WHITE);
    display.drawLine(2, 4, 8, 10, WHITE);
    display.drawLine(2, 10, 8, 4, WHITE);
    display.fillCircle(122, 7, 5, WHITE);
    display.drawLine(119, 4, 125, 10, BLACK);
    display.drawLine(119, 10, 125, 4, BLACK);

    aktualizuj_timestr();
    display.setCursor(0, 16);
    display.print(timestr);
    display.print(" ");

    display.print(SW1TouchVal);
    display.print(" ");
    display.print(SW1TouchValMin);

    display.setCursor(0, 24);
    display.print("CAN ID: 0x");
    display.println(frameID, HEX);  // CAN-BUS ID

    display.setCursor(0, 32);
    display.print("NRF: ");
    display.print(NRFbuf[0]);
    display.print(", ");
    display.println(NRFbuf[2] * 256 + NRFbuf[1]);
    display.setCursor(100, 32);
    display.print("PA:");
    display.println(radio.getPALevel());

    display.setCursor(0, 40);
    display.print(getsmstel());
    display.setCursor(0, 48);
    display.print(SMSbuf);

    /* temperatura narazie wylaczone bo testuje sms

    display.setFont(&FreeSansBold24pt7b);
    // dwie wersje wyswietlania temperatury, druga z miejscem dziesietnym
    display.setCursor(20, 60);
    char odczyt[4];
    dtostrf(celsius, 3, 0, odczyt);
    display.drawCircle(90, 39, 3, WHITE);
    if (celsius == -99) {
        display.print(" --");
    } else {
        display.print(odczyt);
    }
    // display.setCursor(0,60); char odczyt[5]; dtostrf(celsius,3, 1, odczyt); display.print(odczyt); display.drawCircle(95,39,3, WHITE);
    display.setFont(&FreeSans12pt7b);
    display.print(" C");
    display.setFont();
    */
    PokazSW1NaDisplay(0);
    rysuj_jasnosc_na_lcd();  //w tej funkcji na koncu jest display.display();
}

void aktualizuj_timestr() {
    timestr[0] = '0' + hour() / 10;
    timestr[1] = '0' + hour() % 10;
    timestr[3] = '0' + minute() / 10;
    timestr[4] = '0' + minute() % 10;
    timestr[6] = '0' + second() / 10;
    timestr[7] = '0' + second() % 10;
}

void InicjacjaOdczytTemperatury() {
    if (CzyJestCzujnikTemperaury > 0) {  // trzeba zadbac aby odczyt odbył sie za co najmniej 750ms
        ds.reset();
        ds.select(DallasAddr);
        ds.write(0x44, 1);
        timer.setTimeout(1000, OdczytTemperatury);
    }
}

void OdczytTemperatury() {
    byte data[12];
    ds.reset();
    ds.select(DallasAddr);
    ds.write(0xBE);
    for (byte i = 0; i < 9; i++) {
        data[i] = ds.read();
    }

    if (OneWire::crc8(data, 8) == data[8]) {
        int16_t raw = (data[1] << 8) | data[0];
        byte cfg = (data[4] & 0x60);
        if (cfg == 0x00)
            raw = raw & ~7;  // 9 bit resolution, 93.75 ms
        else if (cfg == 0x20)
            raw = raw & ~3;  // 10 bit res, 187.5 ms
        else if (cfg == 0x40)
            raw = raw & ~1;  // 11 bit res, 375 ms
        //// default is 12 bit resolution, 750 ms conversion time
        celsius = (float)raw / 16.0;
    }
}

void sprawdzSW1Touch() {
    SW1TouchVal = pobierzTouchVal(SW1TouchPin, 1, SW1TouchPressed);  // obsluga przycisku dotyku
    if (SW1TouchVal < (SW1TouchMax - 6 + SW1TouchFilter)) {
        SW1TouchPressed = 1;
    } else {
        SW1TouchPressed = 0;
    }
    if (SW1TouchPressed > SW1TouchPrevious) {
        Serial.println("SW1 Touch : Nacisniety");
        PokazSW1NaDisplay(1);
        SW1TouchFilter = 4;
    }
    if (SW1TouchPressed < SW1TouchPrevious) {
        Serial.println("SW1 Touch : Zwolniony");
        PokazSW1NaDisplay(1);
        SW1TouchFilter = 0;
    }
    SW1TouchPrevious = SW1TouchPressed;
}

void PokazSW1NaDisplay(boolean rundisplay) {
    if (SW1TouchPressed)
        display.fillCircle(122, 54, 5, WHITE);
    else
        display.fillCircle(122, 54, 5, BLACK);
    if (rundisplay) display.display();
}

uint8_t pobierzTouchVal(uint8_t TouchPin, uint8_t czymin, boolean isTouchPressed) {
    uint8_t touchvaltmp = 0;
    uint8_t touchval = 255;
    if (isTouchPressed) {
        touchvaltmp = 255;
        for (int i = 0; i < 4; i++) {
            touchval = touchRead(TouchPin);
            if (touchval < touchvaltmp) {
                touchvaltmp = touchval;
            }
        }
    } else {
        touchvaltmp = 0;
        for (int i = 0; i < 4; i++) {
            touchval = touchRead(TouchPin);

            if (touchval > touchvaltmp) {
                touchvaltmp = touchval;
            }
        }
        if (czymin) {
            if (touchval < SW1TouchValMin) {
                SW1TouchValMin = touchval;
            }
        }  // tylko do testow czy sam nie zalaczy, test tylko w petli kiedy nie dotkniety
    }

    touchval = touchvaltmp;
    return touchval;
}

void InicjacjaSW1Touch() {
    // uruchamiane przy starcie w petli 10 razy, ustalamy poziom MAX dotyku oraz wlaczamy TouchActive
    static uint8_t licz = 0;
    static uint8_t liczval[10];
    liczval[licz++] = pobierzTouchVal(SW1TouchPin, 0, 0);  //Serial.print("licz = "); Serial.print(licz); Serial.print("liczval = "); Serial.print(liczval[(licz-1)]); Serial.println();
    if (licz == 10) {                                      //dwa pomijamy i wyciagamy srednia z kolejnych 8 odczytow
        uint16_t tvsumtmp = 0;
        for (int i = 2; i < 10; i++) {
            tvsumtmp += liczval[i];
        }
        tvsumtmp = tvsumtmp / 8;
        Serial.print("tvsumtmp = ");
        Serial.print(tvsumtmp);
        Serial.println();
        SW1TouchMax = tvsumtmp;
        SW1TouchActive = 1;
    }
}
//odczyt najnowszego sms
void readSMS() {
    bool GSMmsg = 0;
    if (Serial.available() > 0) {
        SMSbuf = "";

        //delay(100);  //wazne .. sprawdzic czemu
        while (Serial.available() > 0) {
            SMSbuf = Serial.readString();
        }
        SMSbuf.toUpperCase();  // wiadomosc wielkimi literami

        // tutaj beda sie wykonywaly polecenia z SMS

        if (SMSbuf.indexOf("@ONOFF1") > -1) {
            relays(1);  //pierwszy przekaznik
            GSMmsg = 1;
        }
        if (SMSbuf.indexOf("@ONOFF2") > -1) {
            relays(2);  //drugi przekaznik
            GSMmsg = 1;
        }
        if (SMSbuf.indexOf("@SERVERONOFF") > -1) {
            ServerActive = !ServerActive;
            writeEEPROM(17, ServerActive, 1);
            ESP.restart();
        }
        rysujemy_na_lcd();  // wyswietl SMS na OLED
        if (GSMmsg == 1) {
            if (SMSbuf.indexOf("OK") == -1) {
                Serial.println("AT+CMGDA=\"DEL ALL\"");  //usuwamy wszystkie SMS
            }
            GSMmsg = 0;
        }
    }
}

String getsmstel() {
    if (SMSbuf.length() > 10) {
        uint8_t _idx1 = SMSbuf.indexOf("\"+");
        return SMSbuf.substring(_idx1 + 1, SMSbuf.indexOf("\",\"", _idx1 + 4));
    } else {
        return "";
    }
}
//dla spowolnienia www
void serverON() {
    server.handleClient();
}
// załączenie przekaznika fizycznego i wirtualnego. 1 i 2 to fizyczne wyjscie
void relays(uint8_t n) {
    sp[n - 1] = !sp[n - 1];
    if (n >= 2) {
        digitalWrite(relay, sp[n - 1]);
        Sim800l.sendSms(getsmstel(), String(sp[n - 1]));
    } else {  // NIE TESTOWANE
        uint16_t data = (n << 8) + sp[n - 1];
        sendNRF(6, data);
        sendCAN(255, 6, data, 0);  //toID - 255 dla wszystkich,
    }
}
